#!/usr/bin/env python
# coding: utf-8

# In[46]:


import tkinter as tk
from tkinter import ttk
from selenium import webdriver
from bs4 import BeautifulSoup
import time
from selenium.webdriver.chrome.options import Options
from webdriver_manager.chrome import ChromeDriverManager
import requests
import re
def on_area_selected(event):
    selected_area = area_combobox.get()
    pref_combobox.set("")  # 清空州/省份下拉式選單
    city_combobox.set("")   # 清空城市下拉式選單
    result_label.config(text="")  # 清空結果標籤

    if selected_area == "北海道地方":
        pref_combobox["values"] = ["道北", "道東","道央","道南"]
    elif selected_area == "東北地方":
        pref_combobox["values"] = ["青森県", "岩手県","宮城県","秋田県","山形県","福島県"]
    elif selected_area == "関東・甲信地方":
        pref_combobox["values"] = ["東京都", "神奈川県","埼玉県","千葉県","茨城県","栃木県","群馬県","山梨県","長野県"]
    elif selected_area == "北陸地方":
        pref_combobox["values"] = ["新潟県", "富山県","石川県","福井県"] 
    elif selected_area == "東海地方":
        pref_combobox["values"] = ["愛知県", "岐阜県","静岡県","三重県"] 
    elif selected_area == "近畿地方":
        pref_combobox["values"] = ["大阪府", "兵庫県","京都府","滋賀県"] 
    elif selected_area == "中国地方":
        pref_combobox["values"] = ["鳥取県", "島根県","岡山県","広島県","山口県"] 
    elif selected_area == "四国地方":
        pref_combobox["values"] = ["徳島県", "香川県","愛媛県","高知県"]
    elif selected_area == "九州地方":
        pref_combobox["values"] = ["福岡県", "佐賀県","長崎県","熊本県","大分県","宮崎県","鹿児島県"]
    elif selected_area == "沖縄地方":
        pref_combobox["values"] = ["沖縄県"]

def on_pref_selected(event):
    selected_pref = pref_combobox.get()
    city_combobox.set("")   # 清空城市下拉式選單
    result_label.config(text="")  # 清空結果標籤

    if selected_pref == "道北":
        city_combobox["values"] = ['稚内','声問','沼川','宗谷岬','豊富','浜鬼志別','幌延','天塩','本泊','礼文', '沓形','遠別', '浜頓別',
 '初山別','中川','中頓別', '羽幌','古丹別','焼尻', '音威子府','歌登', '北見枝幸', '小車', '留萌', '達布', '美深', '朱鞠内', '幌糠', '増毛', '西風連',
 '名寄', '幌加内', '士別', '剣淵', '下川', '和寒', '江丹別', '道北朝日', '比布', '旭川', '東神楽', '東川', '道北瑞穂', '美瑛', '上川', '志比内', '上富良野',
 '富良野', '白金', '層雲峡', '麓郷', '道北金山','幾寅','占冠']
    elif selected_pref == "道東":
        city_combobox["values"] = ['網走','東藻琴','女満別','山園','常呂','美幌','小清水','佐呂間', '斜里', '津別','川湯','北見','仁頃山',
 '弟子屈','宇登呂','遠軽','阿寒湖畔','鶴居','生田原','津別二又','湧別','羅臼','境野','中徹別','上標津','糸櫛別','丸瀬布','小利別','標茶','阿寒',
 '鶴丘','陸別','塘路','留辺蘂','上藻別','根室中標津','釧路','紋別小向','中標津','上螺湾','標津','置戸常元','紋別','白糠','白滝','滝上','太田','二俣','柏倉','別海',
 '足寄','茶内原野','知方学','本別','興部','三股','西興部','留真','榊町','ぬかびら源泉郷','押帯','厚床','上士幌','浦幌','雄武','道北池田','道北大津','根室',
 '駒場','納沙布','帯広','糠内','鹿追','帯広泉','芽室','新得','更別','大樹','上札内','広尾']
    elif selected_pref == "道央":
        city_combobox["values"] = ['札幌', '手稲山', '石狩', '道央山口', '小金湯', '江別', '支笏湖畔', '恵庭島松', '道央長沼',
 '小樽', '厚田', '新篠津', '栗沢','赤井川', '月形', '浜益', '岩見沢', '喜茂別', '千歳', '夕張', '余市', '倶知安', '真狩',
 '道央鹿島', '沼の沢', '美唄', '共和', '浦臼', '空知吉野', 'ニセコ', '美国', '神恵内', '蘭越', '滝川', '雨竜', '赤平', '芦別', 
                                   '秩父別', '石狩沼田', '寿都', '深川', '黒松内','道央新城']
    elif selected_pref == "道南":
        city_combobox["values"] = ['室蘭', '登別', '伊達', 'カルルス', '川汲', '洞爺湖温泉', '大滝', '森野', '大沼', '白老','大岸',
 '戸井泊', '森', '道南高松', '函館', '北斗', '八雲', '長万部', '苫小牧', '鶉', '今金', '潮見', '木古内','熊石', '鵡川', 'せたな', '日高門別',
 '江差', '知内', '厚真', '安平', '静内', '千軒', '奥尻', '石崎', '新和','穂別', '笹山', '旭', '三石','松前','米岡','仁世宇','浦河', '日高', '中杵臼',
 '幌満', '目黒', 'えりも岬']
    elif selected_pref == "青森県":
        city_combobox["values"] = ['青森', '青森大谷', '大和山','酸ケ湯', '温川', '五所川原', '黒石', '蟹田',
 '脇野沢', '野辺地','七戸', '碇ケ関', '大鰐', '弘前', '休屋', '六ケ所', '鰺ケ沢', '今別','市浦', '湯野川','十和田','岳', '三沢',
 '戸来', '大間','むつ','三戸','深浦','小田野沢','八戸']
    elif selected_pref == "岩手県":
        city_combobox["values"] = ['盛岡', '滝沢', '好摩', '紫波', '雫石', '区界', '薮川','一方井', '葛根田', '花巻',
 '大迫', '岩手松尾', '豊沢','奥中山', '北上', '沢内', '江刺', '荒屋', '附馬牛', '米里', '川井', '金ヶ崎', '葛巻', '若柳',
 '二戸', '遠野', '衣川', '湯田', '岩泉', '岩手大東', '一関', '宮古', '岩手山形', '大槌', '軽米', '下戸鎖', '千厩', '小本', '住田',
 '祭畤', '普代', '岩手山田', '久慈', '岩手大野', '釜石', '大船渡', '種市']
    
    elif selected_pref == "宮城県":
        city_combobox["values"] = ['仙台', '名取', '塩釜', '大衡', '亘理', '新川', '泉ケ岳', '古川', '蔵王', '鹿島台',
 '丸森', '加美', '宮城白石', '石巻', '築館', '鴬沢', '筆甫', '川渡', '米山', '駒ノ湯', '女川', '雄勝', '志津川', '気仙沼']
        
    elif selected_pref == "秋田県":
        city_combobox["values"] = ['秋田', '岩見三内', '仁別', '雄和', '五城目', '大正寺', '男鹿', '本荘', '秋田大潟',
 '矢島', '男鹿真山', '比立内', '能代', '角館', '阿仁合', '桧木内', '東由利', '大曲', '鎧畑', 'にかほ', '田沢湖', '田沢湖高原',
 '脇神', '鷹巣', '藤里', '笹子', '八森','横手', '秋田湯沢', '大館', '八幡平', '東成瀬', '湯瀬', '鹿角', '湯の岱', '陣場', '秋田藤原']
        
    elif selected_pref == "山形県":
        city_combobox["values"] = ['山形', '東根', '村山', '左沢','上山中山', '高畠', '尾花沢', '長井', '大井沢',
 '肘折', '新庄', '米沢', '瀬見', '山形金山','高峰', '向町', '山形小国', '差首鍋', '荒沢', '山形中津川', '櫛引', '狩川', '鶴岡',
 '酒田大沢', '鼠ケ関', '浜中', '酒田', '飛島']
    
    elif selected_pref == "福島県":
        city_combobox["values"] = ['茂庭', '梁川', '桧原', '福島','相馬', '喜多方',
 '鷲倉','飯舘', '原町', '西会津', '猪苗代', '二本松', '津島', '福島金山', '若松', '船引',
 '浪江', '只見', '湖南', '郡山', '福島川内', '富岡', '南郷', '湯本', '福島長沼', '福島玉川', '小野新町',
 '川前', '広野', '田島', '白河', '石川', '桧枝岐', '舘岩', '平', '東白川', '福島山田', '小名浜']
        
    elif selected_pref == "東京都":
        city_combobox["values"] = ['東京', '江戸川臨海', '羽田', '世田谷', '練馬', '東京府中', '八王子',
 '青梅', '小沢', '小河内', '大島北ノ山', '大島', '利島', '三宅島', '新島',
 '三宅坪田', '神津島', '八丈島', '八重見ヶ原', '青ヶ島', '父島', '母島', '南鳥島']
        
    elif selected_pref == "神奈川県":
        city_combobox["values"] = ['横浜', '日吉', '海老名', '三浦', '辻堂', '相模原中央', '平塚', '相模湖', '丹沢湖', '小田原', '箱根']
        
    elif selected_pref == "埼玉県":
        city_combobox["values"] = ['さいたま', '越谷', '鴻巣', '久喜',
 '所沢', '飯能', '鳩山', '熊谷', 'ときがわ', '浦山','秩父',
 '寄居', '三峰', '上吉田']
        
    elif selected_pref == "千葉県":
        city_combobox["values"] = ['千葉', '船橋', '佐倉', '牛久', '我孫子', '茂原', '坂畑', '木更津',
 '成田', '横芝光', '大多喜', '鴨川', '香取', '勝浦', '鋸南', '東庄', '館山', '銚子']
        
    elif selected_pref == "茨城県":
        city_combobox["values"] = ['水戸', '中野', '笠間', '鉾田', '美野里', '常陸大宮', '日立', '徳田',
 '柿岡', '門井','大能', '大子', '土浦', '江戸崎', '鹿嶋', '下館', '花園', 'つくば', '下妻', '龍ケ崎', '北茨城',
 '坂東', '古河']
        
    elif selected_pref == "栃木県":
        city_combobox["values"] = ['宇都宮', '鹿沼', '高根沢', '真岡', '塩谷', '小山', '栃木', '那須烏山', '葛生',
 '日光東町', '大田原', '佐野', '足尾', '五十里', '奥日光', '黒磯', '足利', '土呂部', '那須高原']
        
    elif selected_pref == "群馬県":
        city_combobox["values"] = ['前橋', '藤岡', '伊勢崎', '上里見', '榛名山', '桐生', '沼田',
 '黒保根', '中之条', '群馬藤原', '神流', 'みなかみ', '西野牧', '片品', '館林', '群馬田代', '草津']
        
    elif selected_pref == "山梨県":
        city_combobox["values"] = ["甲府", "韮崎","勝沼","古関","切石","大泉","河口湖","大月","南部","山中"]
        
    elif selected_pref == "長野県":
        city_combobox["values"] = ['長野', '信濃町', '鬼無里', '菅平', '笠岳', '聖高原', '信州新町',
 '上田', '白馬', '飯山', '鹿教湯', '小谷', '東御', '大町', '野沢温泉', '立科', '白樺湖', '穂高', '松本',
 '軽井沢', '佐久', '諏訪', '原村', '松本今井', '高遠', '辰野', '上高地', '野辺山', '北相木', '杉島', '伊那',
 '奈川', '木祖薮原', '宮田高原', '大鹿', '飯島', '開田高原', '木曽福島', '須原', '御嶽山', '飯田', '南信濃',
 '南木曽', '阿南', '浪合']
        
    elif selected_pref == "新潟県":
        city_combobox["values"] = ['新潟', '松浜', '新津', '巻', '瓢湖', '三条', '村松', '宮寄上', '新潟栃尾', '赤谷', '寺泊',
 '中条', '守門', '長岡', '津川', '室谷', '小出', '大湯', '新潟下関', '羽茂', '両津', '村上', '粟島', '相川', '新潟小国', '三面', '弾崎',
 '柏崎', '高根', '塩沢', '十日町', '新潟湯沢', '松代', '川谷', '津南', '安塚', '新潟大潟', '筒方', '高田', '樽本', '関山', '能生','糸魚川',
 '平岩']
        
    elif selected_pref == "富山県":
        city_combobox["values"] = ['富山', '秋ヶ島', '富山大山', '富山八尾', '伏木', '上市', '猪谷',
 '立山芦峅', '魚津', '砺波', '氷見', '南砺高宮', '宇奈月', '五箇山', '富山朝日']
        
    elif selected_pref == "石川県":
        city_combobox["values"] = ['金沢', '医王山', 'かほく', '白山河内', '宝達志水',
 '小松', '白山白峰', '羽咋','加賀中津原', '志賀', '門前', '七尾', '三井', '輪島', '珠洲', '舳倉島']
    
    elif selected_pref == "福井県":
        city_combobox["values"] = ['福井','春江', '福井美山', '武生', '三国', '越廼', '今庄', '勝山',
 '福井大野', '敦賀', '九頭竜', '美浜', '小浜','大飯']
    
    elif selected_pref == "愛知県":
        city_combobox["values"] = ['名古屋', '大府', '蟹江', '愛知一宮', '愛知豊田', '愛西',
 '小原', '一色', '南知多', 'セントレア', '岡崎', '阿蔵', '蒲郡', '稲武', '作手', '伊良湖',
 '茶臼山', '豊橋','田原', '愛知新城']
        
    elif selected_pref == "岐阜県":
        city_combobox["values"] = ['岐阜', '大垣', '揖斐川', '美濃加茂', '美濃', '関ケ原',
 '関市板取', '樽見', '多治見', '上石津', '岐阜八幡', '伽藍', '長滝', '岐阜金山', '恵那', 'ひるがの',
 '黒川', '岐阜中津川', '宮地', '御母衣', '付知', '六厩', '萩原', '白川', '清見', '船山', '宮之前',
 '河合', '高山', '丹生川', '神岡', '岐阜栃尾']
        
    elif selected_pref == "静岡県":
        city_combobox["values"] = ['静岡', '静岡清水', '高根山', '鍵穴', '有東木', '静岡空港', '川根本町',
 '井川', '菊川牧之原', '土肥', '富士', '春野', '白糸', '三倉', '御前崎', '湯ケ島', '松崎', '掛川',
 '三島', '天竜', '熊', '富士山', '佐久間', '天城山', '網代', '磐田', '石廊崎', '熱海伊豆山', '稲取', '御殿場', '浜松', '三ヶ日']
    
    elif selected_pref == "三重県":
        city_combobox["values"] = ['津', '亀山', '笠取山', '四日市', '白山', '小俣', '上野',
 '粥見', '北勢', '藤坂峠', '桑名', '名張', '南伊勢', '鳥羽', '紀伊長島', '宮川', '阿児', '尾鷲',
 '熊野新鹿', '御浜']
    elif selected_pref == "大阪府":
        city_combobox["values"] = ['大阪', '堺', '生駒山', '大阪八尾', '豊中', '茨木', '枚方', '河内長野', '能勢', '熊取', '関空島']
    
    elif selected_pref == "兵庫県":
        city_combobox["values"] = ['神戸', '神戸空港', '西宮', '三田', '三木', '明石',
 '後川', '西脇', '柏原', '郡家', '姫路', '家島', '福崎', '洲本', '生野', '南淡', '和田山',
 '上郡', '兵庫一宮', '佐用','八鹿', '大屋', '豊岡', '兎和野高原', '香住', '温泉']
    
    elif selected_pref == "京都府":
        city_combobox["values"] = ['京都', '長岡京', '京田辺', '京北', '園部', '京都美山', 
                                   '須知', '本庄', '睦寄', '綾部山家', '三和', '舞鶴', '福知山', '宮津', '坂浦', '峰山', '間人']
    
    elif selected_pref == "滋賀県":
        city_combobox["values"] = ['滋賀大津', '信楽', '南小松', '近江八幡', '東近江', '朽木平良', '土山', '今津', '彦根', '滋賀長浜', '米原', '柳ケ瀬']
    elif selected_pref == "奈良県":
        city_combobox["values"] = ['奈良', '田原本', '針', '大宇陀',
 '葛城', '吉野', '五條', '天川', '曽爾', '風屋', '上北山', '葛川', '下北山']

    elif selected_pref == "和歌山県":
        city_combobox["values"] = ['和歌山', '湯浅', '友ケ島',
 '川辺', '葛城山', '和歌山清水', '高野山', 'かつらぎ', '護摩壇山', '龍神',
 '南紀白浜', '栗栖川', '日置川', '本宮', '西川', '色川', '新宮', '潮岬']
        
    elif selected_pref == "鳥取県":
        city_combobox["values"] = ['鳥取', '湖山', '岩井', '智頭', '青谷',
 '佐治', '鳥取鹿野', '若桜', '倉吉', '関金', '塩津', '鳥取大山', '米子', '江尾','境', '茶屋']

    elif selected_pref == "島根県":
        city_combobox["values"] = ['松江', '島根鹿島', '斐川', '島根大東', '伯太', '横田', '出雲', '掛合',
 '佐田', '海士', '赤名', '大田', '西郷岬', '西郷', '川本', '福光', '島根瑞穂', '桜江', '波佐',
 '浜田', '弥栄', '三隅', '匹見', '益田', '高津', '吉賀', '津和野'] 
   
    
    elif selected_pref == "岡山県":
        city_combobox["values"] = ['岡山', '日応寺', '福渡', '玉野', '倉敷',
 '虫明', '吉備中央', '矢掛', '和気', '旭西', '赤磐', '高梁', '津山', '佐屋', '陣山',
 '久世', '下呰部', '笠岡', '富', '新見', '奈義', '恩原', '上長田', '今岡', '千屋']
        
    elif selected_pref == "広島県":
        city_combobox["values"] = ['広島', '三入', '呉', '東広島', '都志見', '佐伯湯来',
 '志和', '廿日市津田', '倉橋', '加計', '大朝', '大竹', '王泊', '内黒山', '本郷', '美土里',
 '呉市蒲刈', '安宿', '竹原', '甲田', '広島八幡', '世羅', '生口島', '三次', '福山', '君田',
 '広島府中', '上下', '庄原', '高野', '油木', '東城', '道後山']
        
    elif selected_pref == "山口県":
        city_combobox["values"] = ['山口', '防府', '秋吉台',
 '和田', '萩', '東厚保', '篠生', '山口豊田', '宇部', '山口鹿野', '徳佐',
 '下松', '広瀬', '須佐', '油谷', '玖珂', '岩国', '山口下関',
 '羅漢山', '柳井', '安下庄']
    
    elif selected_pref == "徳島県":
        city_combobox["values"] = ['徳島', '日和佐', '福原旭', '蒲生田', '穴吹', '竜王山', '半田', '木頭', '海陽', '徳島池田', '京上']
    
    elif selected_pref == "香川県":
        city_combobox["values"] = ['香川高松', '香南', '滝宮', '多度津', '内海', '引田', '財田']
    
    elif selected_pref == "愛媛県":
        city_combobox["values"] = ['松山','松山南吉田', '上林', '中山',
 '久万', '愛媛玉川', '獅子越峠', '西条', '成就社', '今治', '愛媛長浜', '大洲',
 '大三島', '新居浜', '近永', '八幡浜', '宇和', '富郷', '宇和島', '瀬戸',
 '四国中央', '御荘']
        
    elif selected_pref == "高知県":
        city_combobox["values"] = ['本川', '本山', '池川', '繁藤', '大栃', '魚梁瀬', '佐川', '高知', '後免', '南国日章',
 '船戸', '鳥形山', '安芸','高知田野', '梼原', '須崎', '佐喜浜', '窪川',
 '室戸岬', '江川崎', '大正', '高知佐賀', '宿毛', '中村', '三崎', '高知清水']
        
    elif selected_pref == "福岡県":
        city_combobox["values"] = ['福岡', '博多', '早良脇山', '太宰府', '前原',
 '飯塚', '宗像', '久留米', '柳川', '朝倉', '添田', '耳納山', '小呂島',
 '黒木', '八幡', '英彦山', '大牟田', '東谷','行橋', '空港北町']
        
    elif selected_pref == "佐賀県":
        city_combobox["values"] = ['佐賀', '川副', '北山', '佐賀白石', '鳥栖', '伊万里', '嬉野', '唐津']
        
    elif selected_pref == "長崎県":
        city_combobox["values"] = ['長崎', '大村', '脇岬', '諫早', '長浦岳', '雲仙岳', '口之津',
 '西海', '島原', '佐世保', '松浦', '平戸', '有川', '福江', '石田', '上大津', '芦辺', '厳原', '美津島', '鰐浦']
        
    elif selected_pref == "熊本県":
        city_combobox["values"] = ['熊本', '宇土', '益城', '菊池', '甲佐',
 '岱明', '鹿北', '南阿蘇', '山都', '高森', '三角', '八代', '阿蘇乙姫', '五木',
 '山江', '松島', '一勝地', '人吉', '田浦', '南小国', '多良木', '上', '本渡',
 '湯前横谷', '水俣', '牛深']        
        
    elif selected_pref == "大分県":
        city_combobox["values"] = ['大分', '犬飼', '杵築', '佐賀関', '臼杵',
 '湯布院', '武蔵', '宇目', '竹田', '国見', '院内', '玖珠', '豊後高田', '佐伯', '耶馬渓',
 '中津', '蒲江', '椿ヶ鼻', '日田']
        
    elif selected_pref == "宮崎県":
        city_combobox["values"] = ['宮崎', '赤江', '西都', '国富', '宮崎田野', '高鍋', '野尻', '油津',
 '深瀬', '都農', '小林', '神門', '都城', '西米良', 'えびの高原', '諸塚', '日向', '串間', '加久藤',
 '北方', '日之影', '椎葉', '延岡', '高千穂', '鞍岡', '古江']
        
    elif selected_pref == "鹿児島県":
        city_combobox["values"] = ['鹿児島', '喜入', '八重山', '東市来', '輝北', '加世田', '指宿', '牧之原', '吉ケ別府', '溝辺',
 'さつま柏原', '鹿屋', '大隅','鹿児島川内', '枕崎', '大口', '佐多', '紫尾山', '肝付前田', '志布志', '鹿児島田代', '出水', '内之浦', '阿久根',
 '中甑', '種子島', '屋久島', '尾之間', '中種子', '上中', '中之島', '諏訪之瀬島', '平島', '小宝島', '宝島','喜界島', '笠利',
 '名瀬', '古仁屋', '天城', '伊仙', '沖永良部', '与論島']
        
    elif selected_pref == "沖縄県":
        city_combobox["values"] = ['那覇', '安次嶺', '糸数', '胡屋', '読谷', '渡嘉敷', '宮城島', '名護', '本部',
 '渡名喜', '粟国', '東', '伊是名', '国頭', '久米島', '北原', '奥', '城辺', '鏡原', '宮古島', '北大東', '南大東', '下地島',
 '旧東', '仲筋', '伊原間', '盛山', '川平', '石垣島', '西表島', '大原', '波照間', '与那国島', '所野']
def on_year_selected(event):
    selected_year = year_combobox.get()
    month_combobox.set("")  # 清空月下拉式選單
    day_combobox.set("")   # 清空日下拉式選單
    result_label.config(text="")  # 清空結果標籤

    if selected_year == "2023":
        month_combobox["values"] = ["01", "02","03","04"]
        
    elif selected_year == "2022":
        month_combobox["values"] = ["01", "02","03","04","05","06","07","08","09","10","11","12"]
        
    elif selected_year == "2021":
        month_combobox["values"] = ["01", "02","03","04","05","06","07","08","09","10","11","12"]
        
    elif selected_year == "2020":
        month_combobox["values"] = ["01", "02","03","04","05","06","07","08","09","10","11","12"] 
        
    elif selected_year == "2019":
        month_combobox["values"] = ["01", "02","03","04","05","06","07","08","09","10","11","12"] 
        
    elif selected_year == "2018":
        month_combobox["values"] = ["01", "02","03","04","05","06","07","08","09","10","11","12"] 
        
    elif selected_year == "2017":
        month_combobox["values"] = ["01", "02","03","04","05","06","07","08","09","10","11","12"]
        
    elif selected_year == "2016":
        month_combobox["values"] = ["01", "02","03","04","05","06","07","08","09","10","11","12"]
        
    elif selected_year == "2015":
        month_combobox["values"] = ["01", "02","03","04","05","06","07","08","09","10","11","12"]
def on_month_selected(event):
    selected_month = month_combobox.get()
    day_combobox.set("")   # 清空日下拉式選單
    if selected_month=="01":
        day_combobox["value"]=["01","02","03","04","05","06","07","08","09","10","11","12","13","14","15","16",
                              "17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"]
    elif selected_month=="02":
        day_combobox["value"]=["01","02","03","04","05","06","07","08","09","10","11","12","13","14","15","16",
                              "17","18","19","20","21","22","23","24","25","26","27","28","29"]
    elif selected_month=="03":
        day_combobox["value"]=["01","02","03","04","05","06","07","08","09","10","11","12","13","14","15","16",
                              "17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"]
    elif selected_month=="04":
        day_combobox["value"]=["01","02","03","04","05","06","07","08","09","10","11","12","13","14","15","16",
                              "17","18","19","20","21","22","23","24","25","26","27","28","29","30"]
    elif selected_month=="05":
        day_combobox["value"]=["01","02","03","04","05","06","07","08","09","10","11","12","13","14","15","16",
                              "17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"]
    elif selected_month=="06":
        day_combobox["value"]=["01","02","03","04","05","06","07","08","09","10","11","12","13","14","15","16",
                              "17","18","19","20","21","22","23","24","25","26","27","28","29","30"]
    elif selected_month=="07":
        day_combobox["value"]=["01","02","03","04","05","06","07","08","09","10","11","12","13","14","15","16",
                              "17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"]
    elif selected_month=="08":
        day_combobox["value"]=["01","02","03","04","05","06","07","08","09","10","11","12","13","14","15","16",
                              "17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"]
    elif selected_month=="09":
        day_combobox["value"]=["01","02","03","04","05","06","07","08","09","10","11","12","13","14","15","16",
                              "17","18","19","20","21","22","23","24","25","26","27","28","29","30"]
    elif selected_month=="10":
        day_combobox["value"]=["01","02","03","04","05","06","07","08","09","10","11","12","13","14","15","16",
                              "17","18","19","20","21","22","23","24","25","26","27","28","29","31"]
    elif selected_month=="11":
        day_combobox["value"]=["01","02","03","04","05","06","07","08","09","10","11","12","13","14","15","16",
                              "17","18","19","20","21","22","23","24","25","26","27","28","29","30"]
    elif selected_month=="12":
        day_combobox["value"]=["01","02","03","04","05","06","07","08","09","10","11","12","13","14","15","16",
                              "17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"]
    result_label.config(text="")  # 清空結果標籤
def show_selection():
    area = area_combobox.get()
    pref = pref_combobox.get()
    city = city_combobox.get()
    year = year_combobox.get()
    month = month_combobox.get()
    day = day_combobox.get()
    UI_time = time_combo.get()
    #result_label.config(text=f"選擇結果：{area} - {pref} - {city} -{year}- {month} -{day} -{UI_time}")
    
    area_code_dict={"北海道地方":"1","東北地方":"2","関東・甲信地方":"3","北陸地方":"4","東海地方":"5","近畿地方":"6","中国地方":"7",
                    "四国地方":"8","九州地方":"9","沖縄地方":"10"}
    area_code=area_code_dict[area]
    #print(area_code)
    
    pref_code_dict={'道北': '1', '道東': '3', '道央': '2', '道南': '4', '青森県': '5', '岩手県': '6', '宮城県': '7', '秋田県': '8', '山形県': '9',
                    '福島県': '10', '東京都': '16', '神奈川県': '17', '埼玉県': '14', '千葉県': '15', '茨城県': '11', '栃木県': '12', '群馬県': '13',
                    '山梨県': '22', '長野県': '23', '新潟県': '18', '富山県': '19', '石川県': '20', '福井県': '21', '愛知県': '26', '岐阜県': '24', 
                    '静岡県': '25', '三重県': '27', '大阪府': '30', '兵庫県': '31', '京都府': '29', '滋賀県': '28', '奈良県': '32', '和歌山県': '33', 
                    '鳥取県': '34', '島根県': '35', '岡山県': '36', '広島県': '37', '山口県': '38', '徳島県': '39', '香川県': '40', '愛媛県': '41', 
                    '高知県': '42', '福岡県': '43', '佐賀県': '44', '長崎県': '45', '熊本県': '46', '大分県': '47', '宮崎県': '48', '鹿児島県': '49', '沖縄県': '50'}
    
    city_list=['稚内','声問','沼川','宗谷岬','豊富','浜鬼志別','幌延','天塩','本泊','礼文',
'沓形','遠別','浜頓別','初山別','中川','中頓別','羽幌','古丹別','焼尻','音威子府',
'歌登','北見枝幸','小車','留萌','達布','美深','朱鞠内','幌糠','増毛','西風連',
'名寄','幌加内','士別','剣淵','下川','和寒','江丹別','道北朝日','比布','旭川',
'東神楽','東川','道北瑞穂','美瑛','上川','志比内','上富良野','富良野','白金','層雲峡',
'麓郷','道北金山','幾寅','占冠','網走','東藻琴','女満別','山園','常呂','美幌',
'小清水','佐呂間','斜里','津別','川湯','北見','仁頃山','弟子屈','宇登呂','遠軽',
'阿寒湖畔','鶴居','生田原','津別二又','湧別','羅臼','境野','中徹別','上標津','糸櫛別',
'丸瀬布','小利別','標茶','阿寒','鶴丘','陸別','塘路','留辺蘂','上藻別','根室中標津',
'釧路','紋別小向','中標津','上螺湾','標津','置戸常元','紋別','白糠','白滝','滝上',
'太田','二俣','柏倉','別海','足寄','茶内原野','知方学','本別','興部','三股',
'西興部','留真','榊町','ぬかびら源泉郷','押帯','厚床','上士幌','浦幌','雄武','道北池田',
'道北大津','根室','駒場','納沙布','帯広','糠内','鹿追','帯広泉','芽室','新得',
'更別','大樹','上札内','広尾','札幌','手稲山','石狩','道央山口','小金湯','江別',
'支笏湖畔','恵庭島松','道央長沼','小樽','厚田','新篠津','栗沢','赤井川','月形','浜益',
'岩見沢','喜茂別','千歳','夕張','余市','倶知安','真狩','道北鹿島','沼の沢','美唄',
'共和','浦臼','空知吉野','ニセコ','美国','神恵内','蘭越','滝川','雨竜','赤平',
'芦別','秩父別','石狩沼田','寿都','深川','黒松内','道央新城','室蘭','登別','伊達',
'カルルス','川汲','洞爺湖温泉','大滝','森野','大沼','白老','大岸','戸井泊','森',
'道南高松','函館','北斗','八雲','長万部','苫小牧','鶉','今金','潮見','木古内',
'熊石','鵡川','せたな','日高門別','江差','知内','厚真','安平','静内','千軒',
'奥尻','石崎','新和','穂別','笹山','旭','三石','松前','米岡','仁世宇',
'浦河','日高','中杵臼','幌満','目黒','えりも岬','青森','青森大谷','大和山','酸ケ湯',
'温川','五所川原','黒石','蟹田','脇野沢','野辺地','七戸','碇ケ関','大鰐','弘前',
'休屋','六ケ所','鰺ケ沢','今別','市浦','湯野川','十和田','岳','三沢','戸来',
'大間','むつ','三戸','深浦','小田野沢','八戸','盛岡','滝沢','好摩','紫波',
'雫石','区界','薮川','一方井','葛根田','花巻','大迫','岩手松尾','豊沢','奥中山',
'北上','沢内','江刺','荒屋','附馬牛','米里','川井','金ヶ崎','葛巻','若柳',
'二戸','遠野','衣川','湯田','岩泉','岩手大東','一関','宮古','岩手山形','大槌',
'軽米','下戸鎖','千厩','小本','住田','祭畤','普代','岩手山田','久慈','岩手大野',
'釜石','大船渡','種市','仙台','名取','塩釜','大衡','亘理','新川','泉ケ岳',
'古川','蔵王','鹿島台','丸森','加美','宮城白石','石巻','築館','鴬沢','筆甫',
'川渡','米山','駒ノ湯','女川','雄勝','志津川','気仙沼','秋田','岩見三内','仁別',
'雄和','五城目','大正寺','男鹿','本荘','秋田大潟','矢島','男鹿真山','比立内','能代',
'角館','阿仁合','桧木内','東由利','大曲','鎧畑','にかほ','田沢湖','田沢湖高原','脇神',
'鷹巣','藤里','笹子','八森','横手','秋田湯沢','大館','八幡平','東成瀬','湯瀬',
'鹿角','湯の岱','陣場','秋田藤原','山形','東根','村山','左沢','上山中山','高畠',
'尾花沢','長井','大井沢','肘折','新庄','米沢','瀬見','山形金山','高峰','向町',
'山形小国','差首鍋','荒沢','山形中津川','櫛引','狩川','鶴岡','酒田大沢','鼠ケ関','浜中',
'酒田','飛島','茂庭','梁川','桧原','福島','相馬','喜多方','鷲倉','飯舘',
'原町','西会津','猪苗代','二本松','津島','福島金山','若松','船引','浪江','只見',
'湖南','郡山','福島川内','富岡','南郷','湯本','福島長沼','福島玉川','小野新町','川前',
'広野','田島','白河','石川','桧枝岐','舘岩','平','東白川','福島山田','小名浜',
'東京','江戸川臨海','羽田','世田谷','練馬','東京府中','八王子','青梅','小沢','小河内',
'大島北ノ山','大島','利島','三宅島','新島','三宅坪田','神津島','八丈島','八重見ヶ原','青ヶ島',
'父島','母島','南鳥島','横浜','日吉','海老名','三浦','辻堂','相模原中央','平塚',
'相模湖','丹沢湖','小田原','箱根','さいたま','越谷','鴻巣','久喜','所沢','飯能',
'鳩山','熊谷','ときがわ','浦山','秩父','寄居','三峰','上吉田','千葉','船橋',
'佐倉','牛久','我孫子','茂原','坂畑','木更津','成田','横芝光','大多喜','鴨川',
'香取','勝浦','鋸南','東庄','館山','銚子','水戸','中野','笠間','鉾田',
'美野里','常陸大宮','日立','徳田','柿岡','門井','大能','大子','土浦','江戸崎',
'鹿嶋','下館','花園','つくば','下妻','龍ケ崎','北茨城','坂東','古河','宇都宮',
'鹿沼','高根沢','真岡','塩谷','小山','栃木','那須烏山','葛生','日光東町','大田原',
'佐野','足尾','五十里','奥日光','黒磯','足利','土呂部','那須高原','前橋','藤岡',
'伊勢崎','上里見','榛名山','桐生','沼田','黒保根','中之条','群馬藤原','神流','みなかみ',
'西野牧','片品','館林','群馬田代','草津','甲府','韮崎','勝沼','古関','富士川',
'乙女湖','切石','大泉','河口湖','大月','南部','山中','上野原','長野','信濃町',
'鬼無里','菅平','笠岳','聖高原','信州新町','上田','白馬','飯山','鹿教湯','小谷',
'東御','大町','野沢温泉','立科','白樺湖','穂高','松本','軽井沢','佐久','諏訪',
'原村','松本今井','高遠','辰野','上高地','野辺山','北相木','杉島','伊那','奈川',
'木祖薮原','宮田高原','大鹿','飯島','開田高原','木曽福島','須原','御嶽山','飯田','南信濃',
'南木曽','阿南','浪合','新潟','松浜','新津','巻','瓢湖','三条','村松',
'宮寄上','新潟栃尾','赤谷','寺泊','中条','守門','長岡','津川','室谷','小出',
'大湯','新潟下関','羽茂','両津','村上','粟島','相川','新潟小国','三面','弾崎',
'柏崎','高根','塩沢','十日町','新潟湯沢','松代','川谷','津南','安塚','新潟大潟',
'筒方','高田','樽本','関山','能生','糸魚川','平岩','富山','秋ヶ島','富山大山',
'富山八尾','伏木','上市','猪谷','立山芦峅','魚津','砺波','氷見','南砺高宮','宇奈月',
'五箇山','富山朝日','金沢','医王山','かほく','白山河内','宝達志水','小松','白山白峰','羽咋',
'加賀中津原','志賀','門前','七尾','三井','輪島','珠洲','舳倉島','福井','春江',
'福井美山','武生','三国','越廼','今庄','勝山','福井大野','敦賀','九頭竜','美浜',
'小浜','大飯','名古屋','大府','蟹江','愛知一宮','愛知豊田','愛西','小原','一色',
'南知多','セントレア','岡崎','阿蔵','蒲郡','稲武','作手','伊良湖','茶臼山','豊橋',
'田原','愛知新城','岐阜','大垣','揖斐川','美濃加茂','美濃','関ケ原','関市板取','樽見',
'多治見','上石津','岐阜八幡','伽藍','長滝','岐阜金山','恵那','ひるがの','黒川','岐阜中津川',
'宮地','御母衣','付知','六厩','萩原','白川','清見','船山','宮之前','河合',
'高山','丹生川','神岡','岐阜栃尾','静岡','静岡清水','高根山','鍵穴','有東木','静岡空港',
'川根本町','井川','菊川牧之原','土肥','富士','春野','白糸','三倉','御前崎','湯ケ島',
'松崎','掛川','三島','天竜','熊','富士山','佐久間','天城山','網代','磐田',
'石廊崎','熱海伊豆山','稲取','御殿場','浜松','三ヶ日','津','亀山','笠取山','四日市',
'白山','小俣','上野','粥見','北勢','藤坂峠','桑名','名張','南伊勢','鳥羽',
'紀伊長島','宮川','阿児','尾鷲','熊野新鹿','御浜','大阪','堺','生駒山','大阪八尾',
'豊中','茨木','枚方','河内長野','能勢','熊取','関空島','神戸','神戸空港','西宮',
'三田','三木','明石','後川','西脇','柏原','郡家','姫路','家島','福崎',
'洲本','生野','南淡','和田山','上郡','兵庫一宮','佐用','八鹿','大屋','豊岡',
'兎和野高原','香住','温泉','京都','長岡京','京田辺','京北','園部','京都美山','須知',
'本庄','睦寄','綾部山家','三和','舞鶴','福知山','宮津','坂浦','峰山','間人',
'滋賀大津','信楽','南小松','近江八幡','東近江','朽木平良','土山','今津','彦根','滋賀長浜',
'米原','柳ケ瀬','奈良','田原本','針','大宇陀','葛城','吉野','五條','天川',
'曽爾','風屋','上北山','葛川','下北山','和歌山','湯浅','友ケ島','川辺','葛城山',
'和歌山清水','高野山','かつらぎ','護摩壇山','龍神','南紀白浜','栗栖川','日置川','本宮','西川',
'色川','新宮','潮岬','鳥取','湖山','岩井','智頭','青谷','佐治','鳥取鹿野',
'若桜','倉吉','関金','塩津','鳥取大山','米子','江尾','境','茶屋','松江',
'島根鹿島','斐川','島根大東','伯太','横田','出雲','掛合','佐田','海士','赤名',
'大田','西郷岬','西郷','川本','福光','島根瑞穂','桜江','波佐','浜田','弥栄',
'三隅','匹見','益田','高津','吉賀','津和野','岡山','日応寺','福渡','玉野',
'倉敷','虫明','吉備中央','矢掛','和気','旭西','赤磐','高梁','津山','佐屋',
'陣山','久世','下呰部','笠岡','富','新見','奈義','恩原','上長田','今岡',
'千屋','広島','三入','呉','東広島','都志見','佐伯湯来','志和','廿日市津田','倉橋',
'加計','大朝','大竹','王泊','内黒山','本郷','美土里','呉市蒲刈','安宿','竹原',
'甲田','広島八幡','世羅','生口島','三次','福山','君田','広島府中','上下','庄原',
'高野','油木','東城','道後山','山口','防府','秋吉台','和田','萩','東厚保',
'篠生','山口豊田','宇部','山口鹿野','徳佐','下松','広瀬','須佐','油谷','玖珂',
'岩国','山口下関','羅漢山','柳井','安下庄','徳島','日和佐','福原旭','蒲生田','穴吹',
'竜王山','半田','木頭','海陽','徳島池田','京上','香川高松','香南','滝宮','多度津',
'内海','引田','財田','松山','松山南吉田','上林','中山','久万','愛媛玉川','獅子越峠',
'西条','成就社','今治','愛媛長浜','大洲','大三島','新居浜','近永','八幡浜','宇和',
'富郷','宇和島','瀬戸','四国中央','御荘','本川','本山','池川','繁藤','大栃',
'魚梁瀬','佐川','高知','後免','南国日章','船戸','鳥形山','安芸','高知田野','梼原',
'須崎','佐喜浜','窪川','室戸岬','江川崎','大正','高知佐賀','宿毛','中村','三崎',
'高知清水','福岡','博多','早良脇山','太宰府','前原','飯塚','宗像','久留米','柳川',
'朝倉','添田','耳納山','小呂島','黒木','福岡八幡','英彦山','大牟田','東谷','行橋',
'空港北町','佐賀','川副','北山','佐賀白石','鳥栖','伊万里','嬉野','唐津','長崎',
'大村','脇岬','諫早','長浦岳','雲仙岳','口之津','西海','島原','佐世保','松浦',
'平戸','有川','福江','石田','上大津','芦辺','厳原','美津島','鰐浦','熊本',
'宇土','益城','菊池','甲佐','岱明','鹿北','南阿蘇','山都','高森','三角',
'八代','阿蘇乙姫','五木','山江','松島','一勝地','人吉','田浦','南小国','多良木',
'上','本渡','湯前横谷','水俣','牛深','大分','犬飼','杵築','佐賀関','臼杵',
'湯布院','武蔵','宇目','竹田','国見','院内','玖珠','豊後高田','佐伯','耶馬渓',
'中津','蒲江','椿ヶ鼻','日田','宮崎','赤江','西都','国富','宮崎田野','高鍋',
'野尻','油津','深瀬','都農','小林','神門','都城','西米良','えびの高原','諸塚',
'日向','串間','加久藤','北方','日之影','椎葉','延岡','高千穂','鞍岡','古江',
'鹿児島','喜入','八重山','東市来','輝北','加世田','指宿','牧之原','吉ケ別府','溝辺',
'さつま柏原','鹿屋','大隅','鹿児島川内','枕崎','大口','佐多','紫尾山','肝付前田','志布志',
'鹿児島田代','出水','内之浦','阿久根','中甑','種子島','屋久島','尾之間','中種子','上中',
'中之島','諏訪之瀬島','平島','小宝島','宝島','喜界島','笠利','名瀬','古仁屋','天城',
'伊仙','沖永良部','与論島','那覇','安次嶺','糸数','胡屋','読谷','渡嘉敷','宮城島',
'名護','本部','渡名喜','粟国','東','伊是名','国頭','久米島','北原','奥',
'城辺','鏡原','宮古島','北大東','南大東','下地島','旧東','仲筋','伊原間','盛山',
'川平','石垣島','西表島','大原','波照間','与那国島','所野']
    
    html_list=['11016.html','11061.html','11121.html','11001.html','11176.html','11076.html','13011.html','13061.html','11091.html','11046.html',
'11151.html','13086.html','11206.html','13121.html','12011.html','11276.html','13181.html','13206.html','13146.html','12041.html',
'11316.html','11291.html','12066.html','13277.html','13261.html','12141.html','15041.html','13321.html','13311.html','12217.html',
'12181.html','15076.html','12261.html','12256.html','12231.html','12301.html','12386.html','12266.html','12396.html','12442.html',
'12501.html','12451.html','12457.html','12551.html','12411.html','12512.html','12596.html','12626.html','12607.html','12471.html',
'12632.html','12686.html','12691.html','12746.html','17341.html','17541.html','17531.html','17642.html','17246.html','17631.html',
'17546.html','17316.html','17561.html','17717.html','19021.html','17521.html','17512.html','19051.html','17351.html','17306.html',
'19076.html','19191.html','17501.html','17776.html','17166.html','18038.html','17607.html','19261.html','18161.html','18091.html',
'17386.html','20071.html','19151.html','19346.html','19347.html','20146.html','19281.html','17596.html','17211.html','18174.html',
'19432.html','17116.html','18171.html','20222.html','18136.html','17686.html','17112.html','19416.html','17482.html','17196.html',
'19376.html','19406.html','20202.html','18256.html','20276.html','19301.html','19451.html','20341.html','17076.html','20047.html',
'17091.html','20451.html','19311.html','20186.html','20331.html','18311.html','20266.html','20506.html','17036.html','20441.html',
'20631.html','18273.html','20371.html','18281.html','20432.html','20556.html','20361.html','20551.html','20421.html','20356.html',
'20606.html','20696.html','20601.html','20751.html','14163.html','14157.html','14121.html','14116.html','14191.html','14136.html',
'14286.html','14206.html','15431.html','16091.html','14071.html','14101.html','15391.html','16126.html','15311.html','14026.html',
'15356.html','16286.html','14296.html','15442.html','16076.html','16217.html','16281.html','15451.html','15491.html','15321.html',
'16156.html','15276.html','15231.html','16272.html','16026.html','16061.html','16206.html','15241.html','15197.html','15247.html',
'15251.html','15156.html','15116.html','16252.html','15161.html','16321.html','15216.html','21323.html','21312.html','21297.html',
'21251.html','23206.html','21237.html','21161.html','21171.html','23191.html','21261.html','21226.html','23291.html','23166.html',
'23281.html','23232.html','23226.html','23086.html','23031.html','21187.html','24201.html','24051.html','24166.html','23326.html',
'24141.html','21276.html','24041.html','22141.html','24217.html','23321.html','21111.html','21031.html','22241.html','23356.html',
'24101.html','24236.html','22156.html','21126.html','22206.html','22106.html','22291.html','23376.html','24156.html','22072.html',
'22327.html','22036.html','22306.html','22366.html','22356.html','22391.html','31312.html','31386.html','31321.html','31482.html',
'31562.html','31296.html','31466.html','31201.html','31156.html','31332.html','31411.html','31646.html','31551.html','31461.html',
'31662.html','31336.html','31366.html','31136.html','31186.html','31036.html','31586.html','31451.html','31506.html','31671.html',
'31001.html','31111.html','31721.html','31436.html','31121.html','31602.html','33431.html','33361.html','33296.html','33501.html',
'33421.html','33441.html','33371.html','33231.html','33351.html','33576.html','33581.html','33226.html','33566.html','33176.html',
'33716.html','33486.html','33781.html','33166.html','33596.html','33726.html','33526.html','33711.html','33186.html','33776.html',
'33071.html','33671.html','33841.html','33631.html','33326.html','33856.html','33911.html','33472.html','33136.html','33611.html',
'33026.html','33201.html','33921.html','33336.html','33801.html','33831.html','33206.html','33616.html','33146.html','33086.html',
'33751.html','33877.html','33006.html','34392.html','34436.html','34331.html','34266.html','34471.html','34311.html','34262.html',
'34216.html','34462.html','34276.html','34506.html','34206.html','34461.html','34292.html','34111.html','34056.html','34526.html',
'34096.html','34171.html','34012.html','34296.html','34241.html','34186.html','34026.html','32402.html','32407.html','32408.html',
'32451.html','32296.html','32496.html','32286.html','32571.html','32287.html','32626.html','32276.html','32312.html','32111.html',
'32466.html','32311.html','32376.html','32581.html','32551.html','32426.html','32616.html','32476.html','32431.html','32181.html',
'32126.html','32071.html','32681.html','32056.html','32596.html','32691.html','32136.html','32266.html','32701.html','32206.html',
'32146.html','32771.html','32091.html','32096.html','35426.html','35334.html','35332.html','35376.html','35466.html','35511.html',
'35231.html','35456.html','35361.html','35216.html','35162.html','35552.html','35171.html','35116.html','35541.html','35176.html',
'35486.html','35071.html','35256.html','35537.html','35201.html','35146.html','35141.html','35056.html','35246.html','35086.html',
'35052.html','35002.html','36056.html','36066.html','36106.html','36127.html','36151.html','36176.html','36196.html','36221.html',
'36231.html','36251.html','36276.html','36291.html','36307.html','36342.html','36361.html','36391.html','36411.html','36426.html',
'36461.html','36476.html','36501.html','36511.html','36536.html','36562.html','36571.html','36581.html','36591.html','36597.html',
'36611.html','36641.html','36667.html','36676.html','36716.html','36726.html','36781.html','36821.html','36836.html','36846.html',
'44132.html','44136.html','44166.html','44126.html','44071.html','44116.html','44112.html','44056.html','44051.html','44046.html',
'44173.html','44172.html','44191.html','44226.html','44207.html','44228.html','44216.html','44263.html','44262.html','44281.html',
'44301.html','44316.html','44356.html','46106.html','46061.html','46091.html','46211.html','46141.html','46046.html','46136.html',
'46001.html','46076.html','46166.html','46161.html','43241.html','43256.html','43121.html','43126.html','43266.html','43231.html',
'43171.html','43056.html','43162.html','43157.html','43156.html','43051.html','43151.html','43091.html','45212.html','45106.html',
'45116.html','45291.html','45061.html','45261.html','45326.html','45282.html','45121.html','45181.html','45331.html','45361.html',
'45081.html','45371.html','45346.html','45086.html','45401.html','45147.html','40201.html','40126.html','40191.html','40311.html',
'40251.html','40091.html','40136.html','40066.html','40241.html','40181.html','40076.html','40061.html','40341.html','40391.html',
'40406.html','40231.html','40041.html','40336.html','40281.html','40426.html','40046.html','40326.html','40221.html','41277.html',
'41271.html','41241.html','41331.html','41181.html','41376.html','41371.html','41247.html','41311.html','41172.html','41141.html',
'41361.html','41211.html','41076.html','41166.html','41091.html','41356.html','41116.html','41011.html','42251.html','42341.html',
'42302.html','42286.html','42241.html','42266.html','42146.html','42261.html','42186.html','42046.html','42396.html','42091.html',
'42326.html','42106.html','42366.html','42221.html','42121.html','49142.html','49086.html','49151.html','49196.html','49187.html',
'49052.html','49236.html','49036.html','49251.html','49161.html','49316.html','49256.html','49172.html','48156.html','48061.html',
'48146.html','48216.html','48172.html','48247.html','48196.html','48256.html','48141.html','48066.html','48371.html','48097.html',
'48321.html','48191.html','48031.html','48381.html','48436.html','48296.html','48361.html','48331.html','48386.html','48491.html',
'48561.html','48363.html','48556.html','48546.html','48346.html','48571.html','48516.html','48691.html','48621.html','48466.html',
'48536.html','48681.html','48737.html','48731.html','48531.html','48606.html','48716.html','48601.html','48767.html','48841.html',
'48717.html','48836.html','48826.html','54232.html','54236.html','54296.html','54341.html','54301.html','54396.html','54406.html',
'54462.html','54506.html','54311.html','54387.html','54181.html','54566.html','54501.html','54421.html','54472.html','54616.html',
'54621.html','54191.html','54271.html','54166.html','54086.html','54012.html','54157.html','54606.html','54097.html','54041.html',
'54541.html','54056.html','54761.html','54676.html','54841.html','54671.html','54666.html','54836.html','54661.html','54586.html',
'54737.html','54651.html','54892.html','54816.html','54721.html','54711.html','54876.html','55102.html','55151.html','55156.html',
'55206.html','55091.html','55166.html','55267.html','55217.html','55056.html','55141.html','55041.html','55191.html','55063.html',
'55252.html','55022.html','56227.html','56232.html','56186.html','56286.html','56192.html','56276.html','56346.html','56176.html',
'56301.html','56116.html','56081.html','56146.html','56093.html','56052.html','56036.html','56401.html','57066.html','57026.html',
'57071.html','57106.html','57001.html','57051.html','57206.html','57082.html','57121.html','57248.html','57176.html','57286.html',
'57317.html','57311.html','51106.html','51216.html','51096.html','51011.html','51116.html','51031.html','51056.html','51271.html',
'51311.html','51261.html','51226.html','51192.html','51281.html','51071.html','51241.html','51346.html','51077.html','51331.html',
'51356.html','51247.html','52586.html','52581.html','52511.html','52536.html','52461.html','52571.html','52321.html','52381.html',
'52606.html','52642.html','52331.html','52476.html','52221.html','52406.html','52556.html','52173.html','52482.html','52557.html',
'52346.html','52131.html','52421.html','52181.html','52286.html','52081.html','52137.html','52192.html','52196.html','52041.html',
'52146.html','52152.html','52051.html','52111.html','50331.html','50261.html','50317.html','50247.html','50112.html','50477.html',
'50241.html','50106.html','50476.html','50416.html','50196.html','50232.html','50056.html','50391.html','50551.html','50426.html',
'50491.html','50466.html','50206.html','50386.html','50296.html','50066.html','50226.html','50427.html','50281.html','50536.html',
'50561.html','50211.html','50506.html','50136.html','50456.html','50371.html','53133.html','53091.html','53121.html','53061.html',
'53151.html','53196.html','53112.html','53231.html','53016.html','53287.html','53041.html','53141.html','53296.html','53257.html',
'53326.html','53321.html','53307.html','53378.html','53401.html','53416.html','62078.html','62091.html','62081.html','62096.html',
'62051.html','62037.html','62046.html','62111.html','62016.html','62131.html','62101.html','63518.html','63517.html','63477.html',
'63411.html','63461.html','63496.html','63346.html','63331.html','63216.html','63551.html','63383.html','63491.html','63321.html',
'63571.html','63201.html','63588.html','63121.html','63366.html','63251.html','63241.html','63116.html','63111.html','63051.html',
'63071.html','63016.html','63032.html','61286.html','61306.html','61326.html','61251.html','61242.html','61206.html','61241.html',
'61201.html','61151.html','61196.html','61192.html','61111.html','61187.html','61076.html','61096.html','61031.html','61001.html',
'60216.html','60226.html','60116.html','60161.html','60196.html','60081.html','60236.html','60051.html','60131.html','60061.html',
'60102.html','60026.html','64036.html','64056.html','64041.html','64101.html','64091.html','64136.html','64127.html','64161.html',
'64076.html','64227.html','64206.html','64262.html','64236.html','65042.html','65106.html','65036.html','65201.html','65021.html',
'65121.html','65061.html','65026.html','65127.html','65162.html','65288.html','65256.html','65321.html','65226.html','65306.html',
'65311.html','65276.html','65356.html','69122.html','69052.html','69061.html','69246.html','69041.html','69181.html','69111.html',
'69196.html','69101.html','69161.html','69021.html','69152.html','69076.html','69222.html','69006.html','69271.html','68132.html',
'68091.html','68121.html','68166.html','68181.html','68276.html','68156.html','68261.html','68206.html','68056.html','68306.html',
'68246.html','68046.html','68022.html','68351.html','68286.html','68401.html','68346.html','68436.html','68376.html','68431.html',
'68421.html','68501.html','68462.html','68456.html','68541.html','68516.html','66408.html','66346.html','66296.html','66501.html',
'66446.html','66421.html','66287.html','66391.html','66306.html','66237.html','66251.html','66336.html','66186.html','66381.html',
'66276.html','66171.html','66226.html','66481.html','66112.html','66221.html','66127.html','66056.html','66046.html','66136.html',
'66091.html','67437.html','67292.html','67511.html','67376.html','67217.html','67351.html','67371.html','67421.html','67566.html',
'67212.html','67151.html','67496.html','67211.html','67271.html','67386.html','67161.html','67576.html','67306.html','67461.html',
'67231.html','67136.html','67316.html','67471.html','67106.html','67401.html','67052.html','67326.html','67251.html','67116.html',
'67016.html','67191.html','67126.html','67026.html','81286.html','81371.html','81196.html','81301.html','81071.html','81271.html',
'81146.html','81266.html','81436.html','81228.html','81151.html','81386.html','81231.html','81011.html','81116.html','81397.html',
'81321.html','81428.html','81167.html','81481.html','81486.html','71106.html','71266.html','71211.html','71231.html','71087.html',
'72176.html','71136.html','71251.html','71291.html','71066.html','71191.html','72086.html','72126.html','72121.html','72111.html',
'72061.html','72146.html','72161.html','73166.html','73168.html','73231.html','73271.html','73276.html','73071.html','73321.html',
'73126.html','73247.html','73076.html','73256.html','73306.html','73001.html','73141.html','73446.html','73351.html','73406.html',
'73152.html','73442.html','73341.html','73151.html','73516.html','74056.html','74071.html','74101.html','74126.html','74136.html',
'74151.html','74166.html','74182.html','74187.html','74188.html','74237.html','74238.html','74271.html','74276.html','74296.html',
'74311.html','74336.html','74361.html','74372.html','74381.html','74391.html','74436.html','74447.html','74456.html','74506.html',
'74516.html','82182.html','82186.html','82241.html','82191.html','82171.html','82136.html','82046.html','82306.html','82331.html',
'82261.html','82206.html','82316.html','82036.html','82317.html','82056.html','82272.html','82361.html','82097.html','82101.html',
'82068.html','85142.html','85176.html','85046.html','85166.html','85106.html','85116.html','85161.html','85033.html','84496.html',
'84371.html','84597.html','84441.html','84361.html','84519.html','84561.html','84306.html','84523.html','84266.html','84183.html',
'84171.html','84341.html','84536.html','84122.html','84537.html','84121.html','84072.html','84076.html','84012.html','86141.html',
'86181.html','86146.html','86101.html','86236.html','86086.html','86006.html','86157.html','86197.html','86161.html','86216.html',
'86336.html','86111.html','86411.html','86407.html','86271.html','86461.html','86467.html','86396.html','86066.html','86478.html',
'86477.html','86316.html','86481.html','86451.html','86491.html','83216.html','83341.html','83121.html','83226.html','83286.html',
'83201.html','83126.html','83431.html','83371.html','83021.html','83106.html','83191.html','83061.html','83401.html','83096.html',
'83051.html','83476.html','83242.html','83137.html','87376.html','87412.html','87331.html','87371.html','87406.html','87293.html',
'87361.html','87492.html','87461.html','87251.html','87352.html','87206.html','87426.html','87231.html','87346.html','87127.html',
'87181.html','87501.html','87301.html','87136.html','87086.html','87157.html','87141.html','87041.html','87071.html','87066.html',
'88317.html','88432.html','88211.html','88261.html','88331.html','88371.html','88486.html','88286.html','88392.html','88166.html',
'88107.html','88442.html','88341.html','88151.html','88466.html','88081.html','88551.html','88101.html','88447.html','88406.html',
'88536.html','88066.html','88506.html','88061.html','88131.html','88612.html','88686.html','88706.html','88621.html','88666.html',
'88736.html','88756.html','88746.html','88776.html','88781.html','88851.html','88821.html','88836.html','88901.html','88931.html',
'88956.html','88971.html','88986.html','91197.html','91236.html','91241.html','91161.html','91121.html','91181.html','91166.html',
'91107.html','91066.html','91151.html','91096.html','91081.html','91011.html','91046.html','91146.html','91141.html','91021.html',
'93051.html','93042.html','93041.html','92006.html','92011.html','93012.html','92012.html','93062.html','94001.html','94086.html',
'94036.html','94081.html','94062.html','94101.html','94116.html','94017.html','94011.html']
    pref_code=pref_code_dict[pref]
    #print(pref_code)
    
    city_url_list=dict(zip(city_list,html_list))
    
    city_url=city_url_list[city]
    #print(city_url)
    
    options=Options()
    options.add_argument("--disable-notifications")#取消所有alert
    #driver=webdriver.Chrome("C:/Users/41072/OneDrive/桌面/chromedriver_win32/chromedriver.exe")
    url='https://tenki.jp/past/'+year+'/'+month+'/'+day+'/'+"amedas"+"/"+area_code+'/'+pref_code+'/'+city_url
    #print(url)
    response = requests.get(url)
    #driver.get(url)
    #time.sleep(2)
    #close=driver.find_element(By.CLASS_NAME,"closeBtn")
    #close.click()
    soup = BeautifulSoup(response.text, "html.parser")
    #soup=BeautifulSoup(driver.page_source,"html.parser")
    kanji=soup.find("h2").getText().split("(")[0]
    matches= re.findall(r'\((.*?)\)', soup.find("h2").getText())
    katakana=matches[0]
    weather_data=[]
    for td in soup.find_all("tr")[5:-2]:
        for ttd in td:
            weather_data.append(ttd.getText())
    new_list = [item for item in weather_data[2:] if item not in ['\n', ' ']]
    #new_list2=[item.replace('---', '0') if item == '---' else item for item in new_list]
    time=list(reversed(new_list[0::7]))
    temperature=list(reversed(new_list[1::7]))
    rain_volume=list(reversed(new_list[2::7]))
    wind_direction=list(reversed(new_list[3::7]))
    wind_speed=list(reversed(new_list[4::7]))
    sun_time=list(reversed(new_list[5::7]))
    snow_volume=list(reversed(new_list[6::7]))
    #print('time :',time)
    #print('dtype',type(time))
    
    input_time=int(UI_time.split(':')[0])
    num=input_time-1
    search_time=time[num]
    serach_temperature=temperature[num]
    search_rain_volume=rain_volume[num]
    search_wind_direction=wind_direction[num]
    search_wind_speed=wind_speed[num]
    search_sun_time=sun_time[num]
    search_snow_volume=snow_volume[num]
    #print("地点 : "+kanji+" "+katakana)
    #print("日時 : "+search_time)
    #print("気温(℃) : "+str(serach_temperature))
    #print("降水量(mm) : "+str(search_rain_volume))
    #print("風向(16方位) : "+search_wind_direction)
    #print("風速(m/s) : "+str(search_wind_speed))
    #print("日照時間(分) : "+str(search_sun_time))
    #print("積雪深(cm) : "+str(search_snow_volume))
    result_label.config(text="検索結果："+'\n'+str(year)+"年"+str(month)+"月"+str(day)+"日"+'\n'+"地点 : "+kanji+" "+katakana+'\n'+"日時 : "+search_time+'\n'+"気温(℃) : "+str(serach_temperature)+
                       '\n'+"降水量(mm) : "+str(search_rain_volume)+'\n'+"風向(16方位) : "+search_wind_direction+'\n'+"風速(m/s) : "+str(search_wind_speed)+'\n'
                       +"日照時間(分) : "+str(search_sun_time)+'\n'+"積雪深(cm) : "+str(search_snow_volume),font=("Arial", 12))

root = tk.Tk()
root.title('過去の気象情報！')
root.geometry('400x430')
root.configure(background='white')

# 创建一个标签
labell = tk.Label(root, text="過去の気象アメダス情報を検索しましょう!", font=("Arial", 12))  # 设置初始字体大小为 12
labell.grid(row=0,column=1)

# 創建地區下拉式選單
area_label = ttk.Label(root, text="地域:",font=("Arial", 12))
area_label.grid(row=2, column=0)

area_combobox = ttk.Combobox(root, values=["北海道地方", "東北地方","関東・甲信地方","北陸地方","東海地方","近畿地方","中国地方","四国地方","九州地方","沖縄地方"],font=("Arial", 12))
area_combobox.grid(row=2,column=1)
area_combobox.bind("<<ComboboxSelected>>", on_area_selected)

# 創建縣下拉式選單
pref_label = ttk.Label(root, text="都道府県:",font=("Arial", 12))
pref_label.grid(row=4,column=0)

pref_combobox = ttk.Combobox(root,font=("Arial", 12))
pref_combobox.grid(row=4,column=1)
pref_combobox.bind("<<ComboboxSelected>>", on_pref_selected)

# 創建城市下拉式選單
city_label = ttk.Label(root, text="地点名:",font=("Arial", 12))
city_label.grid(row=6,column=0)
city_combobox = ttk.Combobox(root,font=("Arial", 12))
city_combobox.grid(row=6,column=1)

# 創建年下拉式選單
year_label = tk.Label(root, text="年：",font=("Arial", 12))
year_label.grid(row=8,column=0)
year_combobox = ttk.Combobox(root, values=["2023","2022","2021","2020","2019","2018","2016","2015"],font=("Arial", 12))
year_combobox.grid(row=8,column=1)
year_combobox.bind("<<ComboboxSelected>>", on_year_selected)

# 創建月下拉式選單
month_label = ttk.Label(root, text="月:",font=("Arial", 12))
month_label.grid(row=10,column=0)
month_combobox = ttk.Combobox(root,font=("Arial", 12))
month_combobox.grid(row=10,column=1)
month_combobox.bind("<<ComboboxSelected>>", on_month_selected)

# 創建日下拉式選單
day_label = ttk.Label(root, text="日:",font=("Arial", 12))
day_label.grid(row=12,column=0)
day_combobox = ttk.Combobox(root,font=("Arial", 12))
day_combobox.grid(row=12,column=1)

# 創建時間下拉式選單
time_label = tk.Label(root, text="時間：",font=("Arial", 12))
time_label.grid(row=14,column=0)
time_combo = ttk.Combobox(root, values=["01:00", "02:00","03:00","04:00","05:00","06:00","07:00","08:00",
                                       "09:00","10:00","11:00","12:00","13:00","14:00","15:00","16:00","17:00",
                                       "18:00","19:00","20:00","21:00","22:00","23:00","24:00"],font=("Arial", 12))
time_combo.grid(row=14,column=1)

# 顯示選擇結果
show_button = ttk.Button(root, text="検索", command=show_selection)
show_button.grid(row=18,column=1)

# 顯示結果的標籤
result_label = ttk.Label(root, text="")
result_label.grid(row=22,column=1)

root.mainloop()


# In[ ]:




